/*
    DONE: Дизайн - Виталик
        DONE: Разработать дизайн сайта
        DONE: Создать макеты страниц

    DONE: Верстка - Никита, Паша, Андрей
        DONE: Начать верстку сайта
        DONE: Обеспечить адаптивность и кроссбраузерность
        DONE: Использовать семантическую разметку HTML и CSS стили.

    DONE: Виртуальная файловая система - Никита
        DONE: Разработать виртуальную файловую систему
        DONE: Определить структуру хранения файлов
        DONE: Обеспечить доступ к файлам

    DONE: Система скачивания файлов из steam workshop - Паша
        DONE: Интегрировать API Steam Workshop
        DONE: Создать механизм автоматической загрузки аддонов

    DONE: Поддержка игр - Паша
        DONE: Реализовать функционал поддержки игр
        DONE: Создать базу данных игр
        DONE: Обеспечить возможность добавления новых игр

    DONE: Связь верстки с файловой системой - Паша, Никита
        DONE: Настроить взаимодействие верстки и файловой системы
        DONE: Обеспечить корректное отображение аддонов на сайте

    DONE: DOM API - Паша, Никита
        DONE: Использовать DOM API для динамической манипуляции
        DONE: Реализовать асинхронную загрузку данных
*/
